
# 列表嵌套
test_list = [1,2,3,['a','b','c']]
# for x in test_list:
# #     if type(x) == list:
# #         for y in x:
# #             print(y)
# #     else: print(x)

# 列表相加
# a = [1,2,3]
# b = [3,4,5]
# c = a + b
# print(c)  #[1, 2, 3, 3, 4, 5]

#a[开始:结束:步长]
#开始位置：开始位置包含开始元素
#结束位置：只会取到结束位置前面的一个元素
#列表切片操作
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(a[0:3]) #[1, 2, 3]
# print(a[0:])  #[1, 2, 3, 4, 5, 6]
# print(a[-3:]) #[8, 9, 10]

#步长 默认是1,[::2]则代表步长为2
print(a[::2]) #[1, 3, 5, 7, 9]
print(a[-1:-4:-1]) #[10, 9, 8]
print(a[-1::-1]) #[10, 9, 8, 7, 6, 5, 4, 3, 2, 1]